Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་དེ་དག་ཀྱང་བཏུང་བ་དང་། བཟའ་བ་རྣམ་པ་སྣ་ཚོགས་དེ་དག་འཚལ་ནས། ཚེ་དང་། སྟོབས་དང་། ཁ་དོག་དང་། དབང་པོ་རྣམས་རྣམ་པར་འཕེལ་བར་འགྱུར་རོ། །
en: “When beings consume them as various kinds of drink and food, their lifespans, strength, complexions, and faculties will increase.

source: གཟི་བྱིན་དང་། སྟོབས་དང་། ཁ་དོག་དང་། གཟུགས་དང་རབ་ཏུ་ལྡན་པར་གྱུར་ནས་ཀྱང་། ས་ལ་མཆིས་པའི་དགོས་པ་རྣམ་པ་སྣ་ཚོགས་ཐ་དད་པ་འབུམ་ཕྲག་དུ་མ་དག་བགྱིད་པར་འགྱུར།
en: Being endowed with such majesty, strength, complexion, and form, they will accomplish many hundreds of thousands of the various different things necessary on this earth.

source: བརྩོན་པར་འགྱུར། འབད་པར་འགྱུར།
en: They will be dedicated to that and make an effort in that.

source: སྟོབས་སུ་བགྱི་བའི་ལས་རྣམས་བགྱིད་པར་འགྱུར་རོ། །
en: They will accomplish actions that create strength.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་རྒྱུ་དེས་འཛམ་བུའི་གླིང་ཐམས་ཅད་ཞི་བར་འགྱུར་བ་དང་། ལོ་ལེགས་པ་དང་། རྒྱས་པ་དང་། ཉམས་དགའ་བར་འགྱུར།
en: “Venerable Bhagavat, that will cause all of Jambudvīpa to have peace, good harvests, increase, and joy.

source: འཛམ་བུའི་གླིང་གི་སེམས་ཅན་དེ་དག་ཐམས་ཅད་བདེ་བར་འགྱུར། དགའ་བ་རྣམ་པ་སྣ་ཚོགས་མྱོང་བར་འགྱུར།
en: All the beings in Jambudvīpa will become happy and experience various kinds of joy.

source: སེམས་ཅན་དེ་དག་གཟི་བྱིན་དང་། སྟོབས་དང་། ཁ་དོག་དང་། གཟུགས་དང་ལྡན་པར་འགྱུར་རོ། །
en: Those beings will possess majesty, strength, and excellent color and form.

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདིའི་སླད་དུ། དགེ་སློང་ངམ། དགེ་སློང་མ་འམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་མདོ་སྡེའི་དབང་པོ་འཛིན་པ་དེ་དག་ཆོས་ཀྱི་ཁྲི་སྟན་ལ་མཆིས་པའི་གན་དུ་མཆི་བར་འགྱུར།
en: “For the sake of this Lord King of Sūtras, the Sublime Golden Light, bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās should approach the Dharma seat of those who possess this lord and king of the sūtras.

source: མཆིས་ནས་ཀྱང་སེམས་རབ་ཏུ་དང་བས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་དང་ཕན་པ་དང་བདེ་བ་དང་། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་རྒྱ་ཆེར་ཡང་དག་པར་རབ་ཏུ་བཤད་པར་བགྱི་བའི་སླད་དུ། ཆོས་སྨྲ་བ་དེ་དག་ལ་གསོལ་བ་འདེབས་པར་འགྱུར་རོ། །
en: Having approached it with a perfectly trusting mind, for the welfare, benefit, and happiness of all beings, they should supplicate the dharmabhāṇaka so that this Lord King of Sūtras, the Sublime Golden Light will be taught extensively.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་རབ་ཏུ་བཤད་པ་ན་སའི་ལྷ་མོ་བརྟན་མ་བདག་གཡོག་དང་བཅས་ཏེ། རབ་ཏུ་གཟི་བྱིན་དང་ལྡན་པ་དང་། རབ་ཏུ་སྟོབས་དང་ལྡན་པར་འགྱུར་རོ། །
en: Venerable Bhagavat, if this Lord King of Sūtras, the Sublime Golden Light is taught, I, the earth goddess Dṛḍhā, with my servants, will have supreme magnificence and supreme strength.

source: བདག་ཅག་གི་ལུས་ལ་སྟོབས་དང་། བརྩོན་འགྲུས་དང་། མཐུ་ཆེན་པོ་བསྐྱེད་པར་འགྱུར།
en: Our bodies will develop perfect strength, diligence, and great power.

source: བདག་ཅག་གི་ལུས་ལ་གཟི་བྱིན་དང་། དཔལ་དང་། ཕུན་སུམ་ཚོགས་པ་ཡང་འཇུག་པར་འགྱུར་རོ། །
en: Our bodies will gain magnificence, glory, and splendor.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་སའི་ལྷ་མོ་བརྟན་མ་བདག་ཆོས་བདུད་རྩིའི་ཁུ་བ་འདིས་ཚིམ་པར་གྱུར། གཟི་བྱིན་དང་། །
en: “Venerable Bhagavat, I, the earth goddess Dṛḍhā, will be satiated by this amṛta liquid of the Dharma.

source: སྟོབས་དང་། བརྩོན་འགྲུས་དང་། མཐུ་དང་། ཤུགས་ཆེན་པོ་ཐོབ་པར་གྱུར་ན།
en: I will attain great magnificence, strength, diligence, power, and speed.

source: ས་ཆེན་པོ་དཔག་ཚད་སྟོང་ཕྲག་བདུན་པའི་འཛམ་བུའི་གླིང་འདི་སའི་བཅུད་ཆེན་པོས་རྣམ་པར་འཕེལ་བར་འགྱུར་རོ། །
en: The great fertility of earth will increase in this Jambudvīpa’s seven thousand yojanas.

source: ས་ཆེན་པོ་གཟི་བྱིན་དང་རབ་ཏུ་ལྡན་པར་འགྱུར་རོ། །
en: The great earth will become magnificent.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ས་ལ་བརྟེན་པའི་སེམས་ཅན་འདི་དག་ཐམས་ཅད་ཀྱང་འཕེལ་ཞིང་རྒྱས་ལ་ཡངས་པར་འགྱུར། རྒྱ་ཆེན་པོར་ཡང་འགྱུར་རོ། །
en: “Venerable Bhagavat, the beings who dwell upon the earth will increase, expand, and become vast.

source: ས་ལ་གནས་པའི་སེམས་ཅན་དེ་དག་ཆེན་པོར་གྱུར་ནས་ཀྱང་། ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱོད་པ་སྣ་ཚོགས་ལ་སྤྱོད་པར་འགྱུར། བདེ་བ་དག་ཀྱང་མྱོང་བར་འགྱུར་རོ། །དེ་དག་ཐམས་ཅད་བཟའ་བ་དང་། བཏུང་བ་དང་བཅའ་བ་རྣམ་པ་སྣ་ཚོགས་དང་། གོས་དང་། མལ་ཆ་དང་།
en: They will also become widespread, and just as the beings who are upon the earth will become widespread, they will also experience a variety of enjoyments.

source: སྟན་དང་། གནས་དང་། ཁང་པ་དང་། གཞལ་མེད་ཁང་དང་། སྐྱེད་མོས་ཚལ་དང་། ཆུ་བོ་དང་། རྫིང་དང་།
en: They will experience happiness.

source: ཆུ་མིག་དང་། མཚེའུ་དང་། མཚོ་དང་། ལྟེང་ཀ་དང་། འདི་ལྟ་བུའི་ཡོ་བྱད་བདེ་བ་རྣམ་པ་སྣ་ཚོགས་ས་ལ་གནས་པ་ས་ལས་འབྱུང་བ་ས་ལ་རྟེན་པ་འདི་དག་ལ་སྤྱོད་པར་འགྱུར་རོ། །
en: They will all enjoy various kinds of food and drink, remain in various kinds of happiness with the entire variety of pleasurable requisites that are present upon the earth, appear from the earth, and are dependent upon the earth, such as clothes, beds, seats, dwellings, houses, divine palaces, parks, rivers, pools, springs, ponds, lakes, and reservoirs.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་རྒྱུ་དེས་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱིས་བདག་ལ་བྱས་པ་གཟོ་བར་བགྱིའོ། །
en: “Venerable Bhagavat, because of this, all those beings will be repaying my kindness.

source: གདོན་མི་འཚལ་བར་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་བསྟི་སྟང་དུ་བགྱིས་ཏེ། མཉན་པར་བགྱི། བཀུར་སྟིར་བགྱི། བླ་མར་བགྱི། རིམ་གྲོར་བགྱི། མཆོད་པར་བགྱིའོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་གང་གི་ཚེ་སེམས་ཅན་དེ་དག་ཆོས་སྨྲ་བའི་གན་དུ་མཆི་བའི་སླད་དུ། རིགས་ཐ་དད་པ་དང་། ཁྱིམ་ཐ་དད་པ་དག་ནས་བྱུང་སྟེ་མཆིས་ནས། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉན་པར་གྱུར་ལ།
en: There is no doubt that this Lord King of Sūtras, the Sublime Golden Light should be respected, listened to, honored, venerated, revered, and offered to.

source: ཐོས་ནས་ཀྱང་རང་རང་གི་རིགས་དང་། ཁྱིམ་དང་། གྲོང་དང་། གྲོང་རྡལ་ཐ་དད་པ་དག་ཏུ་ཞུགས་ནས། རང་རང་གི་ཁྱིམ་ན་གནས་པ་དག་ཕན་ཚུན་དུ་འདི་སྐད་ཅེས་བདག་ཅག་གིས་དེ་རིང་ཆོས་མཉན་པ་ཟབ་མོ་ཐོས་སོ། །
en: “Venerable Bhagavat, when those beings leave their individual families and individual homes in order to go to the dharmabhāṇaka; and having gone there have listened to this Lord King of Sūtras, the Sublime Golden Light; and having heard it returned to their own individual families, homes, villages, and market towns, they will say to those who live in their own home, ‘We have heard a profound Dharma today.

source: དེ་རིང་བདག་ཅག་གིས་བསོད་ནམས་ཀྱི་ཕུང་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བཟུང་ངོ་། །
en: We have obtained an inconceivable accumulation of merit today.

source: བདག་ཅག་གིས་ཆོས་མཉན་པ་དེས། དེ་བཞིན་གཤེགས་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མ་དག་མཉེས་པར་བྱས་སོ། །
en: By listening to that Dharma, we have pleased many hundreds of thousands of quintillions of tathāgatas.

source: དེང་བདག་ཅག་གིས་ཆོས་མཉན་པ་འདིས་སེམས་ཅན་དམྱལ་བ་ལས་ཡོངས་སུ་ཐར་ཏོ། །དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། ཡི་དགས་ཀྱི་ཡུལ་ལས་ཡོངས་སུ་ཐར་རོ། །
en: By listening to that Dharma today, we have been completely freed from rebirth in the hells, as animals, in the world of Yama, and in the realm of the pretas.

source: དེང་བདག་ཅག་གིས་ཆོས་མཉན་པ་འདིས་མ་འོངས་པའི་དུས་ན། ཚེ་རབས་འབུམ་ཕྲག་དུ་མར་ལྷ་དང་མིའི་སྐྱེ་བ་ཡོངས་སུ་བཟུང་བར་འགྱུར་རོ་ཞེས་གཏམ་ཟེར་བར་འགྱུར་རོ། །ཁྱིམ་ཐ་དད་པ་ན་གནས་པར་གྱུར་པ་དེ་དག་སེམས་ཅན་གཞན་དག་ལ། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས་ཐ་ན་དཔེ་གཅིག་ཙམ་བརྗོད་དམ། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས་ཐ་ན་ལེའུ་གཅིག་གམ། སྔོན་བྱུང་བ་གཅིག་གམ།
en: By listening to this Dharma today, we have obtained rebirth in the future as devas and humans for many hundreds of thousands of lifetimes.’

source: ཐ་ན་བྱང་ཆུབ་སེམས་དཔའི་མིང་ངམ། དེ་བཞིན་གཤེགས་པའི་མཚན་གཅིག་གམ། ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་གམ། ཚིག་གཅིག་ཅིག་སེམས་ཅན་གཞན་དག་ལ་ཐོས་པར་བགྱིད་དམ། ཐ་ན་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདིའི་མཚན་གཞན་དག་ལ་རབ་ཏུ་སྟོན་ཏམ། བཙུན་པ་བཅོམ་ལྡན་འདས་གང་དང་གང་ན་སེམས་ཅན་རྣམ་པ་ཐ་དད་པ་དེ་དག་ཕྱོགས་རྣམ་པ་ཐ་དད་པ་དག་ཏུ་མདོ་སྡེའི་གཏན་ཚིགས་རྣམ་པ་སྣ་ཚོགས་འདི་ལྟ་བུ་འདི་དག་གཅིག་ལ་གཅིག་བརྗོད་དམ།
en: “When they are in their own homes, if they tell even one example from this Lord King of Sūtras, the Sublime Golden Light to those other beings, or just one chapter from this Lord King of Sūtras, the Sublime Golden Light, or one history, or even the name of one bodhisattva, or the name of one tathāgata, or even just one four-line verse, or even a single line of verse, and those other beings hear it—or even if they teach others the name only of this Lord King of Sūtras, the Sublime Golden Light—then, venerable Bhagavat, wherever those different beings in different places speak about, or listen to, or talk to one another about these various kinds of causes from the sūtra, then, venerable Bhagavat, all those places will become very magnificent.

source: ཐོས་པར་བགྱིད་དམ། གཏམ་རྒྱུད་བརྗོད་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་ས་ཕྱོགས་དེ་དག་ཐམས་ཅད་ཤིན་ཏུ་གཟི་བྱིན་དང་ལྡན་པ་དང་། ཤིན་ཏུ་སྣུམ་པར་འགྱུར་རོ། །ས་ཕྱོགས་དེ་དང་དེ་དག་ཏུ་སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱི་ཕྱིར།
en: They will become very lustrous.

source: སའི་བཅུད་རྣམ་པ་སྣ་ཚོགས་དང་། ཡོ་བྱད་ཐམས་ཅད་རྒྱས་པར་སྐྱེ་བར་འགྱུར། རྣམ་པར་འཕེལ་བར་འགྱུར། ཤིན་ཏུ་རྒྱས་པར་འགྱུར། སེམས་ཅན་དེ་དག་ཐམས་ཅད་ཀྱང་བདེ་བར་འགྱུར་རོ། །
en: In those various places, for all those beings, the various fertilities of the earth and all requisites will increase, augment, and expand, and all those beings will be happy.

source: ནོར་ཆེ་བ་དང་། ལོངས་སྤྱོད་ཆེ་བ་དང་།
en: They will have great wealth and great enjoyments.

source: སྦྱིན་པ་ལ་མོས་པར་འགྱུར། དཀོན་མཆོག་གསུམ་ལ་མངོན་པར་དད་པར་འགྱུར་རོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: They will aspire to generosity, and they will have true faith in the Three Jewels.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་སའི་ལྷ་མོ་བརྟན་མ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །སའི་ལྷ་མོ་སེམས་ཅན་གང་ལ་ལ་དག །གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས་ཐ་ན་ཚིག་གཅིག་ཉན་ན། དེ་དག་མིའི་འཇིག་རྟེན་འདི་ནས་ཤི་འཕོས་ནས་སུམ་ཅུ་རྩ་གསུམ་ལྷའི་རིས་ཀྱི་ནང་དུ་ལྷའི་རིས་གང་ཡང་རུང་བ་ཞིག་ཏུ་སྐྱེ་བར་འགྱུར་རོ། །སའི་ལྷ་མོ་སེམས་ཅན་གང་ལ་ལ་དག །གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་དག་ལ་མཆོད་པའི་ཕྱིར།
en: When she had spoken, the Bhagavat said to Dṛḍhā, the goddess of the earth, “Goddess of the earth, if any being listens to even one line from this Lord King of Sūtras, the Sublime Golden Light, when they pass away from this human world, they will be reborn as a deva in the Trāyastriṃśa paradise or among another class of devas.

source: གནས་དེ་དག་ལེགས་པར་བརྒྱན་པར་བྱེད་དམ། ཐ་ན་གདུགས་གཅིག་གམ། བ་དན་གཅིག་གམ། རས་བཅོས་བུ་གཅིག་གིས་གཡོགས་ན། སའི་ལྷ་མོ་རྟག་ཏུ་བརྒྱན་པའི་གནས་དེ་དག་འདོད་པ་ན་སྤྱོད་པའི་ལྷའི་རིས་བདུན་པོ་དེ་དག་ཏུ་ལྷའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གཞལ་མེད་ཁང་རྒྱན་ཐམས་ཅད་ཀྱིས་ལེགས་པར་བརྒྱན་པ་དག་ཏུ་གནས་པར་འགྱུར་རོ། །
en: “Goddess of the earth, anyone who, in order to make offerings to this Lord King of Sūtras, the Sublime Golden Light, beautifully adorns those places, even with just one parasol or one flag or by draping one cloth, then, goddess of the earth, they will dwell in those constantly adorned places, divine aerial palaces made of the seven jewels in the seven paradises of the desire realm that are perfectly adorned by all adornments.

source: གང་གི་ཚེ་སེམས་ཅན་དེ་དག་མིའི་འཇིག་རྟེན་འདི་ནས་ཤི་འཕོས་ཏེ། རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གཞལ་མེད་ཁང་དེ་དག་ཏུ་སྐྱེ་བ་དེའི་ཚེ། སའི་ལྷ་མོ་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་གཞལ་མེད་ཁང་རེ་རེར་ཡང་ལན་བདུན་བདུན་དུ་སྐྱེ་བར་འགྱུར་རོ། །
en: When those beings pass away from this human realm, they will be reborn in those aerial palaces made of the seven jewels, and at that time, goddess of the earth, they will be reborn seven times in each of those aerial palaces made of the seven jewels.

source: ལྷའི་བདེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དག་ཀྱང་མྱོང་བར་འགྱུར་རོ། །
en: They will experience the inconceivable bliss of the devas.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་སའི་ལྷ་མོ་བརྟན་མས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་དེས་ན་སའི་ལྷ་མོ་བརྟན་མ་བདག་དགེ་སློང་ཆོས་སྨྲ་བ། ཆོས་ཀྱི་ཁྲི་སྟན་ལ་མཆིས་པ་དེའི་ཚེ་ཆོས་ཀྱི་སྟན་གྱི་འོག་ལོགས་ཀྱི་ས་ཕྱོགས་དེ་དང་དེ་དག་ཏུ་གནས་པར་བགྱིའོ། །
en: When the Bhagavat had spoken, the earth goddess Dṛḍhā said to the Bhagavat, “Therefore, venerable Bhagavat, when the dharmabhāṇaka bhikṣu is seated on the Dharma seat, I, the earth goddess Dṛḍhā, will be present in the ground below that Dharma seat.

source: ཅི་ནས་ཀྱང་སངས་རྒྱས་འབུམ་ཕྲག་དག་ལ་དགེ་བའི་རྩ་བ་བསྐྲུན་པའི་སེམས་ཅན་དེ་དག་གི་དོན་གྱི་སླད་དུ། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་འཛམ་བུའི་གླིང་དུ་ཡུན་རིང་དུ་གནས་ཤིང་མྱུར་དུ་ནུབ་པར་མི་འགྱུར་བ་དང་། སེམས་ཅན་རྣམས་ཀྱང་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ཉན་པར་འགྱུར་བ་དང་། མ་འོངས་པའི་དུས་ན་བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་འབུམ་ཕྲག་དུ་མར་ལྷ་དང་། མིའི་བདེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་མྱོང་བར་འགྱུར་བ་དང་། དེ་བཞིན་གཤེགས་པ་དང་འགྲོགས་པར་འགྱུར་བ་དང་། མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་དང་། སེམས་ཅན་དམྱལ་བ་དང་། དུད་འགྲོའི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་གྱི་སྡུག་བསྔལ་ཐམས་ཅད་ཤིན་ཏུ་རྒྱུན་ཆད་པར་འགྱུར་བར་ལུས་མི་གདའ་བར་བགྱིས་ཏེ། དགེ་སློང་ཆོས་སྨྲ་བ་དེའི་རྐང་པ་ལ་ཡན་ལག་གི་དམ་པ་མགོས་བརྟེན་པར་བགྱིའོ། །
en: For the sake of those beings who have planted good roots with hundreds of thousands of buddhas, I will make my body invisible and will support that dharmabhāṇaka bhikṣu’s feet with my highest limb, my head, so that this Lord King of Sūtras, the Sublime Golden Light will remain for a long time in Jambudvīpa and will not disappear soon; so that beings will hear this Lord King of Sūtras, the Sublime Golden Light and will experience the happiness of devas and humans for many hundreds of thousands of quintillions of eons; and so that they will be in the company of tathāgatas and will, in a future time, attain the highest, most complete enlightenment of buddhahood and will become completely free of the suffering of the hells, the lives of animals, and the world of Yama.”

source: དེ་ནས་སའི་ལྷ་མོ་བརྟན་མས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then the earth goddess Dṛḍhā said, “Bhagavat, I have a mantra essence.

source: བཅོམ་ལྡན་འདས་བདག་ལ་སྔགས་ཀྱི་སྙིང་པོ་ཞིག་མཆིས་པ་འདི་ལྷ་དང་མི་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བར་འགྱུར་བ་སྟེ། གང་སྐྱེས་པའམ། བུད་མེད་དམ། འཁོར་བཞི་པོ་གང་ལ་ལ་ཞིག་གིས།
en: It will bring benefit and happiness to all devas and humans.

source: བདག་མངོན་སུམ་དུ་མཐོང་བར་འདོད་པ་དང་། ནོར་དང་། ནོར་བུ་རིན་པོ་ཆེ་དང་། དབྱིག་ལ་སོགས་པ་འདོད་པ་དང་། སྨན་བཟང་པོས་ཚེ་རིང་ཞིང་ནད་མེད་པར་འདོད་པ་དང་། ཕས་ཀྱི་དགྲ་ཐམས་ཅད་དང་། ཕྱིར་རྒོལ་བ་ཐམས་ཅད་འཇིལ་བར་འདོད་ན། གནས་དབེན་པར་དཀྱིལ་འཁོར་བྱས་ཏེ། ཁྲུས་བྱས་གོས་སར་པ་བགོས་ཏེ། རྩྭ་བཏིང་བའི་སྟེང་དུ་འདུག་ནས།
en: If someone wishes to see me directly; wishes for precious jewels, treasures, and so on; wishes for a long life without illness through excellent herbs; or wishes to be free of all adversaries and opponents, they should make a circle in a solitary place, wash, wear new clothes, and sit on an arrangement of straw.

source: སྐུ་གཟུགས་རིང་བསྲེལ་ཅན་གྱི་མདུན་ནམ། མཆོད་རྟེན་རིང་བསྲེལ་ཅན་གྱི་མདུན་དུ། མེ་ཏོག་དང་། བདུག་པ་དང་། ཞལ་ཟས་སྣ་ཚོགས་ཀྱིས་མཆོད་དེ།
en: In front of an image that contains relics or in front of a stūpa that contains relics, make an offering of flowers, incense, and various kinds of food.

source: སྐར་མ་རྒྱལ་དང་སྦྱར་བའི་ཚེས་བརྒྱད་ལ་སེམས་རྩེ་གཅིག་གིས་གཟུངས་སྔགས་འདི་བཟླས་པས་སྤྱན་དྲངས་པར་འགྱུར་ཏེ། སྔགས་ལ། ཏདྱ་ཐཱ། ཙི་ལི་ཙི་ལི། ཙུ་རུ་ཙུ་རུ། ཀུ་རུ་ཀུ་རུ། ཀུ་ཊུ་ཀུ་ཊུ། ཏོ་ཊུ་ཏོ་ཊུ།
en: On the eighth day during the time of the lunar asterism Puṣya, invite me by repeating this dhāraṇī-mantra single-mindedly.

source: བ་ཧ་བ་ཧ། བ་རི་ཤེ། བ་རི་ཤེ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་འཁོར་བཞི་པོ་གང་ལ་ལ་ཞིག་གིས། བདག་སྤྱན་དྲང་བའི་ཕྱིར་སྔགས་ཀྱི་ཚིག་འདི་བརྒྱ་རྩ་བརྒྱད་བཟླས་ན།
en: “The mantra is: tadyathā | cili cili curu curu kuru kuru kuṭu kuṭu toṭu toṭu vaha vaha variṣe variṣe svāhā | “Bhagavat, I will come to anyone among the four classes of followers who repeats these mantra words a hundred and eight times in order to invite me.

source: བདག་དེའི་གན་དུ་མཆི་བར་བགྱིའོ། །གཞན་ཡང་བཅོམ་ལྡན་འདས་སེམས་ཅན་གང་ལ་ལ་ཞིག་བདག་དང་མཇལ་ཞིང་སྨྲ་བར་འཚལ་ན། ཆོ་ག་སྔ་མའི་ཚུལ་དུ་བཤམས་ཏེ། སྔགས་འདི་བཟླས་པར་བྱའོ། །ཏདྱ་ཐཱ། ཨཉྩ་ནི། ཀྱ་ལིཀྵ་ནི། ཤི་ཤི་དྷ་རི། ཧ་ཧ། ཧི་ཧི། ཀུ་རུ་བ་རེ་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་སྔགས་ཀྱི་ཚིག་འདི་བརྒྱ་རྩ་བརྒྱད་བཟླས་ཏེ། སྔགས་སྔ་མ་བཟླས་པ་བྱས་ན། དེའི་མདུན་དུ་ལུས་བསྟན་ཏེ། ངེས་པར་བསམ་པ་རྫོགས་པར་བགྱིའོ། །
en: “Moreover, Bhagavat, anyone who seeks to meet me and speak to me, should do the same as in the previous rite and repeat this mantra: tadyathā | añcani kyalikṣani śiśidhari haha hihi kuruvare svāhā | “Bhagavat, I will come to the one who repeats the words of this mantra and then repeats the previous mantra, and I will definitely fulfill their wishes.

source: གང་སྔགས་འདི་ཟློས་པར་འདོད་པས། སྔར་ལུས་བསྲུང་བའི་ཕྱིར་སྔགས་འདི་བརྗོད་དོ། །ཏདྱ་ཐཱ། ཤི་རི་ཤི་རི། བཱ་ཤ་ཀ་ཏི། ཏ་ཏི། ཀུཊྚི། པཱུ་ཏ། པཱུ་དེ་རི། པུ་དེ་རི་ཊི་ཊེ། པ་ཊི་ཀུ་ཀུ་ཊི།
en: “Whoever wishes to repeat this mantra, in order to protect their body, should first repeat this mantra: tadyathā | śiri śiri vāśakati tati kuṭṭi pūta pūderi pūderi tiṭe pati kukuṭi kapacili svāhā | “Bhagavat, when practicing this dhāraṇī-mantra one should apply the mantra to a cord of five colors, tying a knot with each repetition.

source: ཀ་པ་ཙི་ལི་སྭཱ་ཧཱ། བཅོམ་ལྡན་འདས་གཟུངས་སྔགས་འདི་བསྒྲུབ་པའི་ཚེ་ཚོན་སྐུད་སྣ་ལྔ་ལ་སྔགས་ལན་རེ་གདབ་ཅིང་མདུད་པ་རེ་རེ་བཅིང་ངོ་། །དེ་འདྲ་བ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་ཏེ། དཔུང་པ་གཡོན་པ་ལ་བཏགས་ན་འཇིགས་པ་ཐམས་ཅད་བསལ་ཏེ། ལུས་བསྲུངས་པར་འགྱུར་རོ། །
en: Having repeated the mantra in that way twenty-one times, tie the cord on to the left upper arm and this will dispel all danger and the body will be protected.

source: སེམས་མི་གཡེང་བར་སྔགས་འདི་བཟླས་ན། བསམ་པ་ཐམས་ཅད་འགྲུབ་པར་འགྱུར་རོ། །
en: If this mantra is repeated with an undistracted mind, all wishes will be accomplished.

source: བདག་གི་ཚིག་འདི་མི་བསླུ་བར་ནི་སངས་རྒྱས་དཀོན་མཆོག་དང་།
en: These words of mine are infallible.

source: ཆོས་དཀོན་མཆོག་དང་། དགེ་འདུན་དཀོན་མཆོག་རྣམས་བདག་ལ་མངོན་དུ་གཟིགས་ཤིང་དགོངས་པར་གསོལ།
en: I pray that the Buddha Jewel, the Dharma Jewel, and the Saṅgha Jewel look upon me and regard me.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་སའི་ལྷ་མོ་བརྟན་མ་ལ་ལེགས་སོ་ཞེས་བཀའ་སྩལ་ཏེ། གང་ཁྱོད་ཀྱི་བདེན་པའི་སྔགས་ཀྱི་ཚིག་འདིས་མདོ་སྡེའི་དབང་པོ་འདི་དང་། ཆོས་སྨྲ་བ་དེ་ལ་བསྲུང་བ་བྱས་པ་དེ་ནི་ལེགས་སོ་ལེགས་སོ། །
en: Then the Bhagavat congratulated the earth goddess Dṛḍhā, saying, “It is excellent, excellent, that through your words of truth you have protected this Lord King of Sūtras, the Sublime Golden Light along with the dharmabhāṇakas.

source: དེའི་ཕྱིར་ཁྱོད་ཀྱང་བསོད་ནམས་ཀྱི་ཚོགས་དཔག་ཏུ་མེད་པ་དང་ལྡན་པར་འགྱུར་རོ། །
en: Therefore, you also possess an inconceivable accumulation of merit.”

source: གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ལས། སའི་ལྷ་མོ་བརྟན་མའི་ལེའུ་ཞེས་བྱ་སྟེ་བཅྭ་བརྒྱད་པའོ།། །།དེ་ནས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཡང་དག་ཤེས། གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་དང་ལྷན་ཅིག་ཏུ་སྟན་ལས་ལངས་ཏེ། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ནས། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ད་ལྟར་དང་། མ་འོངས་པའི་དུས་ན། གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། ལྗོངས་སམ། དགོན་པའི་ཕྱོགས་སམ། རིའི་སྨན་ལྗོངས་སམ།
en: This concludes “Dṛḍhā, the Goddess of the Earth,” the eighteenth chapter of “The Lord King of Sūtras, the Sublime Golden Light.”

source: ཕོ་བྲང་འཁོར་གང་དུ་འབྱུང་བར་འགྱུར་བ་དེར། བཙུན་པ་བཅོམ་ལྡན་འདས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཡང་དག་ཤེས་བདག་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཉི་ཤུ་རྩ་བརྒྱད་པོ་དེ་དག་དང་ལྷན་ཅིག་ཏུ་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། ལྗོངས་སམ།
en: Chapter 19: Saṃjñeya, the Lord of Yakṣas Then the great yakṣa general Saṃjñeya, accompanied by twenty-eight yakṣa generals, rose from his seat and with his robe over one shoulder, kneeling with his right knee on the ground and with palms together, bowed toward the Bhagavat and said to the Bhagavat, “Venerable Bhagavat, wherever this Lord King of Sūtras, the Sublime Golden Light appears, in the present or in future times, whether in a village, town, market town, region, wilderness, mountain cave, or royal residence, Bhagavat, I, the great yakṣa general Saṃjñeya, accompanied by twenty-eight yakṣa generals, will come to that village, town, market town, region, wilderness, mountain cave, or royal residence.

source: དགོན་པའི་ཕྱོགས་སམ། རིའི་སྨན་ལྗོངས་སམ། ཕོ་བྲང་འཁོར་དེར་མཆི་བར་བགྱིའོ། །ལུས་མི་གདའ་བར་བགྱིས་ཏེ། དགེ་སློང་ཆོས་སྨྲ་བ་དེ་བསྲུང་བར་བགྱིའོ། །
en: “I will make my body invisible and will guard that dharmabhāṇaka bhikṣu.

source: ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཆད་པ་སྤང་བ་དང་། ཞི་བ་དང་བདེ་ལེགས་སུ་འགྱུར་བར་བགྱིའོ། །སྐྱེས་པའམ། བུད་མེད་དམ།
en: I will defend him, take care of him, protect him, save him from punishment, and bring him peace and well-being.

source: ཁྱེའུ་འམ། བུ་མོ་ཆོས་ཉན་པ་དེ་དག་ཐམས་ཅད་དང་། གང་སུ་དག་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས་ཐ་ན་ཚིག་བཞི་པའི་ཚིགས་སུ་བཅད་པ་གཅིག་ཉན་པ་དང་། ཐ་ན་ཚིག་གཅིག་གམ། ཐ་ན་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདི་ལས་བྱང་ཆུབ་སེམས་དཔའི་མིང་གཅིག་གམ། དེ་བཞིན་གཤེགས་པའི་མཚན་གཅིག་ཙམ་ཐོས་པར་གྱུར་ཏེ། གཟུང་བ་དང་། ཐ་ན་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་འདིའི་མིང་ཐོས་པར་གྱུར་ཏེ། གཟུང་བ་དེ་དག་ཐམས་ཅད་ཀུན་ཏུ་བསྲུང་བར་བགྱིའོ། །ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཞི་བ་དང་། བདེ་ལེགས་སུ་འགྱུར་བར་བགྱིའོ། །རིགས་དེ་དག་དང་། ཁྱིམ་དེ་དག་དང་།
en: “All men, women, boys, or girls who listen to the Dharma, whoever hears and retains even one four-line verse from this Lord King of Sūtras, the Sublime Golden Light, or even one line, or even the name of one bodhisattva from this Lord King of Sūtras, the Sublime Golden Light, or the name of one tathāgata, or even hears and retains just the name of this Lord King of Sūtras, the Sublime Golden Light, I will defend them all, take care of them, protect them, save them from punishment, and bring them peace and well-being.

source: གྲོང་དེ་དག་དང་། གྲོང་ཁྱེར་དེ་དག་དང་། གྲོང་རྡལ་དེ་དག་དང་། དགོན་པ་དེ་དག་དང་། ཕོ་བྲང་འཁོར་དེ་དག་ཀྱང་ཀུན་དུ་བསྲུང་བར་བགྱིའོ། །ཡོངས་སུ་བསྐྱབ་པ་དང་། ཡོངས་སུ་གཟུང་བ་དང་། ཡོངས་སུ་བསྐྱང་བ་དང་། ཆད་པ་སྤང་བ་དང་། ཞི་བ་དང་། བདེ་ལེགས་སུ་འགྱུར་བར་བགྱིའོ། །
en: I will defend, take care of, protect, save from punishment, and bring peace and well-being to all those families, those homes, those villages, those towns, those market towns, those wildernesses, and those royal residences.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་རྒྱུ་གང་གིས་བདག་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཡང་དག་ཤེས་ཞེས་མིང་དུ་ཆགས་པར་གྱུར་ཅེ་ན། འདི་ནི་བཙུན་པ་བཅོམ་ལྡན་འདས་ཉིད་ཀྱི་མངོན་སུམ་ལགས་ཏེ།
en: “Venerable Bhagavat, why am I called the great yakṣa general Saṃjñeya?

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་ཆོས་ཐམས་ཅད་འཚལ་ཏོ། །ཆོས་ཐམས་ཅད་ཡོངས་སུ་འཚལ་ཏོ། །ཆོས་ཐམས་ཅད་ཁོང་དུ་ཆུད་དོ། །ཆོས་ཐམས་ཅད་ཇི་སྙེད་པ་དང་།
en: Venerable Bhagavat, it is because I know all Dharmas, I understand all Dharmas, I comprehend all Dharmas.

source: ཆོས་ཐམས་ཅད་ཇི་ལྟ་བ་དང་། ཆོས་ཐམས་ཅད་གནས་པ་གང་ལགས་པ་དང་། ཆོས་ཐམས་ཅད་གང་དག་ལགས་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རིགས་གང་དག་ལགས་པ་དང་། བཙུན་པ་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་བདག་ལ་མངོན་སུམ་མོ། །
en: Whatever the number of Dharmas, the nature of the Dharmas, or the classes of Dharmas, venerable Bhagavat, I have direct knowledge of all Dharmas.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ལ་བདག་གི་ཡེ་ཤེས་སྣང་བ་བསམ་གྱིས་མི་ཁྱབ་བོ། །ཡེ་ཤེས་ཀྱི་གསལ་བ་བསམ་གྱིས་མི་ཁྱབ་བོ། །ཡེ་ཤེས་ཀྱི་རྒྱུ་བ་བསམ་གྱིས་མི་ཁྱབ་བོ། །ཡེ་ཤེས་ཀྱི་ཕུང་པོ་བསམ་གྱིས་མི་ཁྱབ་བོ། །
en: “Venerable Bhagavat, in all Dharmas my illumination by wisdom is inconceivable, my clarity of wisdom is inconceivable, my activity of wisdom is inconceivable, and my accumulation of wisdom is inconceivable.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཆོས་ཐམས་ཅད་ལ་བདག་གི་ཡེ་ཤེས་ཀྱི་ཡུལ་འཇུག་པ་བསམ་གྱིས་མི་ཁྱབ་བོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ལྟར་བདག་ཆོས་ཐམས་ཅད་ཡང་དག་པར་འཚལ་བ་དང་།
en: “Venerable Bhagavat, in all Dharmas my engagement in the field of wisdom is inconceivable.

source: ཡང་དག་པར་ཡོངས་སུ་བརྟགས་པ་དང་། ཡང་དག་པར་ཡོངས་སུ་འཚལ་བ་དང་། ཡང་དག་པར་རྣམ་པར་བལྟས་པ་དང་། ཡང་དག་པར་ཁོང་དུ་ཆུད་པའི་རྒྱུ་དེས་ན། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་ཡང་དག་ཤེས་ཞེས་མིང་དུ་ཆགས་སོ། །
en: “Venerable Bhagavat, it is because of my correct knowledge, my correct examination, my correct view, and my correct comprehension of all Dharmas that I am named the great yakṣa general Saṃjñeya.
